/****************************************
 * @file shader_pixel_3d_unlit.hlsl
 * @brief 3D�p�s�N�Z���A�����b�g�V�F�[�_�[
 * @author Natsume Shidara
 * @date 2025/11/21
 * @update 2025/11/21
 ****************************************/

//--------------------------------------
// �萔�o�b�t�@��`
//--------------------------------------
// �}�e���A���J���[
cbuffer ColorBuffer : register(b0)
{
    float4 MaterialColor;
}

//--------------------------------------
// �\���̒�`
//--------------------------------------
// �s�N�Z���V�F�[�_�[���͍\����
// ��VS_OUTPUT�ƈ�v������
struct PS_INPUT
{
    float4 posH : SV_POSITION; // �X�N���[�����W
    float4 color : COLOR0; // ���_�J���[
    float2 uv : TEXCOORD0; // �e�N�X�`�����W
};

//--------------------------------------
// �e�N�X�`���E�T���v���[��`
//--------------------------------------
Texture2D Tex : register(t0); // �x�[�X�e�N�X�`��
SamplerState Samp : register(s0); // �T���v���[

//======================================
// ���C���֐�
//======================================
/**
 * @brief �s�N�Z���V�F�[�_�[�G���g���[�|�C���g
 * @param ps_in ���X�^���C�Y�ς݃f�[�^
 * @return �ŏI�o�̓J���[
 * @detail ���C�e�B���O�v�Z���s�킸�A�e�N�X�`���ƃJ���[�̏�Z���ʂ�Ԃ��܂��B
 */
struct PS_OUTPUT
{
    float4 color    : SV_TARGET0;
    float4 emissive : SV_TARGET1;
};

PS_OUTPUT main(PS_INPUT ps_in)
{
    PS_OUTPUT output;
    output.color = Tex.Sample(Samp, ps_in.uv);
    output.emissive = float4(0.0f, 0.0f, 0.0f, 0.0f);
    return output;
}